* Question
Does the order of the restrictions in the multiple-dwelling procedure affect the answer? Does it affect the time to find an answer? If you think it matters, demonstrate a faster program obtained from the given one by reordering the restrictions. If you think it does not matter, argue your case.

* Answer
Multiple-dwelling problem is commutative, so the order of the restrictions does not change the answer. Placing the more expensive predicates last will minimize the number of times they are called.

The optimized procedure is around 20% faster than the original:

#+begin_src scheme :results output :exports both
  ;; Load
  (load "4.ambeval.scm")

  ;; Answer
  (define orig
    '(let ((baker (amb 1 2 3 4 5))
           (cooper (amb 1 2 3 4 5))
           (fletcher (amb 1 2 3 4 5))
           (miller (amb 1 2 3 4 5))
           (smith (amb 1 2 3 4 5)))
       (require (distinct? (list baker cooper fletcher miller smith)))
       (require (not (= baker 5)))
       (require (not (= cooper 1)))
       (require (not (= fletcher 5)))
       (require (not (= fletcher 1)))
       (require (> miller cooper))
       (require (not (= (abs (- smith fletcher)) 1)))
       (require (not (= (abs (- fletcher cooper)) 1)))
       (list (list 'baker baker)
             (list 'cooper cooper)
             (list 'fletcher fletcher)
             (list 'miller miller)
             (list 'smith smith))))

  (define fast
    '(let ((baker (amb 1 2 3 4 5))
           (cooper (amb 1 2 3 4 5))
           (fletcher (amb 1 2 3 4 5))
           (miller (amb 1 2 3 4 5))
           (smith (amb 1 2 3 4 5)))
       (require (> miller cooper))
       (require (not (= fletcher 5)))
       (require (not (= fletcher 1)))
       (require (not (= baker 5)))
       (require (not (= cooper 1)))
       (require (not (= (abs (- smith fletcher)) 1)))
       (require (not (= (abs (- fletcher cooper)) 1)))
       (require (distinct? (list baker cooper fletcher miller smith)))
       (list (list 'baker baker)
             (list 'cooper cooper)
             (list 'fletcher fletcher)
             (list 'miller miller)
             (list 'smith smith))))

  ;; Test
  (map (lambda (obj)
         (display (car obj))
         (display " ")
         (display (elapsed (cdr obj)))
         (newline))
       (list (cons 'orig (lambda () (mc-eval orig)))
             (cons 'fast (lambda () (mc-eval fast)))))
#+end_src

#+RESULTS:
: orig 2.29
: fast 1.92
